; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 41)
	(= (value c1) 10)
	(= (value c2) 85)
	(= (value c3) 8)
	(= (value c4) 42)
	(= (value c5) 38)
	(= (value c6) 89)
	(= (value c7) 100)
	(= (value c8) 78)
	(= (value c9) 23)
	(= (value c10) 78)
	(= (value c11) 90)
	(= (value c12) 4)
	(= (value c13) 77)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 7 of 13
2. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 7 of 13
3. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 7 of 13
4. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 7 of 13
5. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 7 of 13
6. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 7 of 13
7. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 7 of 13
8. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 7 of 13
9. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 13
10. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 13
11. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 13
12. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 13
13. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 7 of 13
14. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 13
15. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 13
16. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 7 of 13
17. (increment c9)
   changed: (value c9) from 23 to 30
   goals met: 7 of 13
18. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 13
19. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 13
20. (increment c8)
   changed: (value c8) from 78 to 82
   goals met: 7 of 13
21. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 13
22. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 13
23. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 13
24. (increment c8)
   changed: (value c8) from 82 to 87
   goals met: 7 of 13
25. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 13
26. (increment c8)
   changed: (value c8) from 87 to 93
   goals met: 7 of 13
27. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 13
28. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 13
29. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 13
30. (increment c5)
   changed: (value c5) from 38 to 41
   goals met: 7 of 13
31. (increment c5)
   changed: (value c5) from 41 to 44
   goals met: 8 of 13
32. (increment c9)
   changed: (value c9) from 30 to 37
   goals met: 8 of 13
33. (increment c8)
   changed: (value c8) from 93 to 99
   goals met: 8 of 13
34. (decrement c7)
   changed: (value c7) from 100 to 98
   goals met: 9 of 13
35. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 9 of 13
36. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 9 of 13
37. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 9 of 13
38. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 9 of 13
39. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 9 of 13
40. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 9 of 13
41. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 9 of 13
42. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 9 of 13
43. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 9 of 13
44. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 9 of 13
45. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 9 of 13
46. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 9 of 13
47. (increment c12)
   changed: (value c12) from 4 to 11
   goals met: 9 of 13
48. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 9 of 13
49. (increment c12)
   changed: (value c12) from 11 to 19
   goals met: 9 of 13
50. (increment c12)
   changed: (value c12) from 19 to 27
   goals met: 9 of 13
51. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 9 of 13
52. (increment c12)
   changed: (value c12) from 27 to 36
   goals met: 9 of 13
53. (increment c12)
   changed: (value c12) from 36 to 45
   goals met: 9 of 13
54. (increment c12)
   changed: (value c12) from 45 to 54
   goals met: 9 of 13
55. (increment c12)
   changed: (value c12) from 54 to 63
   goals met: 9 of 13
56. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 9 of 13
57. (increment c12)
   changed: (value c12) from 63 to 73
   goals met: 9 of 13
58. (decrement c11)
   changed: (value c11) from 90 to 85
   goals met: 9 of 13
59. (increment c12)
   changed: (value c12) from 73 to 83
   goals met: 8 of 13
60. (decrement c11)
   changed: (value c11) from 85 to 80
   goals met: 9 of 13
61. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 9 of 13
62. (increment c9)
   changed: (value c9) from 37 to 45
   goals met: 9 of 13
63. (increment c9)
   changed: (value c9) from 45 to 53
   goals met: 9 of 13
64. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 9 of 13
65. (increment c9)
   changed: (value c9) from 53 to 62
   goals met: 9 of 13
66. (increment c9)
   changed: (value c9) from 62 to 71
   goals met: 9 of 13
67. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 9 of 13
68. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 9 of 13
69. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 9 of 13
70. (increment c3)
   changed: (value c3) from 8 to 17
   goals met: 9 of 13
71. (increment c3)
   changed: (value c3) from 17 to 26
   goals met: 9 of 13
72. (increment c3)
   changed: (value c3) from 26 to 35
   goals met: 9 of 13
73. (increment c3)
   changed: (value c3) from 35 to 44
   goals met: 8 of 13
74. (increment c3)
   changed: (value c3) from 44 to 53
   goals met: 8 of 13
75. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 13
76. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 13
77. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 13
78. (increment c3)
   changed: (value c3) from 53 to 62
   goals met: 8 of 13
79. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 8 of 13
80. (increment c3)
   changed: (value c3) from 62 to 72
   goals met: 8 of 13
81. (decrement_rate c4)
   changed: (rate_value c4) from 1 to 0
   goals met: 8 of 13
82. (decrement c3)
   changed: (value c3) from 72 to 62
   goals met: 8 of 13
83. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 8 of 13
84. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 8 of 13
85. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 8 of 13
86. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 8 of 13
87. (increment c9)
   changed: (value c9) from 71 to 81
   goals met: 7 of 13
88. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 13
89. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 13
90. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 7 of 13
91. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 7 of 13
92. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 7 of 13
93. (increment c1)
   changed: (value c1) from 10 to 15
   goals met: 7 of 13
94. (increment c1)
   changed: (value c1) from 15 to 20
   goals met: 7 of 13
95. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 7 of 13
96. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 7 of 13
97. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 7 of 13
98. (increment c1)
   changed: (value c1) from 20 to 26
   goals met: 7 of 13
99. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 7 of 13
100. (increment c1)
   changed: (value c1) from 26 to 33
   goals met: 7 of 13
101. (increment c1)
   changed: (value c1) from 33 to 40
   goals met: 7 of 13
102. (increment c1)
   changed: (value c1) from 40 to 47
   goals met: 8 of 13
103. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 8 of 13
104. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 8 of 13
105. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 8 of 13
106. (decrement c2)
   changed: (value c2) from 85 to 80
   goals met: 8 of 13
107. (decrement c2)
   changed: (value c2) from 80 to 75
   goals met: 8 of 13
108. (decrement c2)
   changed: (value c2) from 75 to 70
   goals met: 8 of 13
109. (decrement c2)
   changed: (value c2) from 70 to 65
   goals met: 8 of 13
110. (decrement c2)
   changed: (value c2) from 65 to 60
   goals met: 9 of 13
111. (decrement c3)
   changed: (value c3) from 62 to 52
   goals met: 8 of 13
112. (decrement c3)
   changed: (value c3) from 52 to 42
   goals met: 8 of 13
113. (decrement c2)
   changed: (value c2) from 60 to 55
   goals met: 8 of 13
114. (increment c3)
   changed: (value c3) from 42 to 52
   goals met: 8 of 13
115. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 13
116. (decrement c2)
   changed: (value c2) from 55 to 50
   goals met: 9 of 13
117. (increment c4)
   changed: (value c4) from 42 to 43
   goals met: 9 of 13
118. (decrement c3)
   changed: (value c3) from 52 to 42
   goals met: 9 of 13
119. (decrement c2)
   changed: (value c2) from 50 to 45
   goals met: 8 of 13
120. (decrement c2)
   changed: (value c2) from 45 to 40
   goals met: 9 of 13
121. (decrement c1)
   changed: (value c1) from 47 to 40
   goals met: 8 of 13
122. (decrement c1)
   changed: (value c1) from 40 to 33
   goals met: 9 of 13
123. (decrement c0)
   changed: (value c0) from 41 to 39
   goals met: 9 of 13
124. (decrement c0)
   changed: (value c0) from 39 to 37
   goals met: 9 of 13
125. (decrement c0)
   changed: (value c0) from 37 to 35
   goals met: 9 of 13
126. (decrement c0)
   changed: (value c0) from 35 to 33
   goals met: 9 of 13
127. (decrement c0)
   changed: (value c0) from 33 to 31
   goals met: 10 of 13
128. (decrement c9)
   changed: (value c9) from 81 to 71
   goals met: 11 of 13
129. (decrement c8)
   changed: (value c8) from 99 to 89
   goals met: 10 of 13
130. (decrement c8)
   changed: (value c8) from 89 to 79
   goals met: 10 of 13
131. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 10 of 13
132. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 10 of 13
133. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 10 of 13
134. (decrement c7)
   changed: (value c7) from 98 to 93
   goals met: 10 of 13
135. (decrement c7)
   changed: (value c7) from 93 to 88
   goals met: 9 of 13
136. (decrement c7)
   changed: (value c7) from 88 to 83
   goals met: 9 of 13
137. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 9 of 13
138. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 9 of 13
139. (increment c8)
   changed: (value c8) from 79 to 89
   goals met: 10 of 13
140. (increment c7)
   changed: (value c7) from 83 to 88
   goals met: 10 of 13
141. (decrement c6)
   changed: (value c6) from 89 to 87
   goals met: 11 of 13
142. (increment c9)
   changed: (value c9) from 71 to 81
   goals met: 10 of 13
143. (decrement c8)
   changed: (value c8) from 89 to 79
   goals met: 10 of 13
144. (decrement c7)
   changed: (value c7) from 88 to 83
   goals met: 9 of 13
145. (decrement c7)
   changed: (value c7) from 83 to 78
   goals met: 10 of 13
146. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 10 of 13
147. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 10 of 13
148. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 10 of 13
149. (decrement c6)
   changed: (value c6) from 87 to 82
   goals met: 10 of 13
150. (decrement c6)
   changed: (value c6) from 82 to 77
   goals met: 11 of 13
151. (decrement c9)
   changed: (value c9) from 81 to 71
   goals met: 11 of 13
152. (decrement c8)
   changed: (value c8) from 79 to 69
   goals met: 11 of 13
153. (decrement c7)
   changed: (value c7) from 78 to 73
   goals met: 10 of 13
154. (decrement c7)
   changed: (value c7) from 73 to 68
   goals met: 11 of 13
155. (decrement c6)
   changed: (value c6) from 77 to 72
   goals met: 11 of 13
156. (decrement c6)
   changed: (value c6) from 72 to 67
   goals met: 12 of 13
157. (decrement c12)
   changed: (value c12) from 83 to 73
   goals met: 12 of 13
158. (decrement c11)
   changed: (value c11) from 80 to 75
   goals met: 11 of 13
159. (decrement c11)
   changed: (value c11) from 75 to 70
   goals met: 12 of 13
160. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 12 of 13
161. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 12 of 13
162. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 12 of 13
163. (decrement c10)
   changed: (value c10) from 78 to 75
   goals met: 12 of 13
164. (decrement c10)
   changed: (value c10) from 75 to 72
   goals met: 12 of 13
165. (decrement c10)
   changed: (value c10) from 72 to 69
   goals met: 12 of 13
166. (decrement c9)
   changed: (value c9) from 71 to 61
   goals met: 12 of 13
167. (decrement c8)
   changed: (value c8) from 69 to 59
   goals met: 12 of 13
168. (decrement c7)
   changed: (value c7) from 68 to 63
   goals met: 11 of 13
169. (decrement c7)
   changed: (value c7) from 63 to 58
   goals met: 12 of 13
170. (decrement c6)
   changed: (value c6) from 67 to 62
   goals met: 12 of 13
171. (decrement c6)
   changed: (value c6) from 62 to 57
   goals met: 13 of 13
